# IsOrthonormal Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Frame..::..IsOrthonormal Method
Frame Class See Also
---
Determines if this frame's basis vectors are orthonormal.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsOrthonormal()
```

Visual Basic
---
```text
Public Function IsOrthonormal As Boolean
```

Visual C++
---
```text
public:
bool IsOrthonormal()
```

# ### Return Value
True if this frame's basis vectors are orthonormal, false if not.
# Remarks
"Orthonormal" means that the three vectors are orthogonal and each of them has unit length.
# See Also
Frame Class
Autodesk.Revit.DB Namespace